CircuitMess/Arduino-ESP32/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision

##############################################################

ringo.name=Ringo by CircuitMess

ringo.vid.0=0x10c4
ringo.pid.0=0xea60

ringo.upload.tool=esptool_py
ringo.upload.maximum_size=1310720
ringo.upload.maximum_data_size=327680
ringo.upload.wait_for_upload_port=false

ringo.serial.disableDTR=true
ringo.serial.disableRTS=true

ringo.build.mcu=esp32
ringo.build.core=esp32
ringo.build.variant=d32
ringo.build.board=LOLIN_D32

ringo.build.f_cpu=240000000L
ringo.build.flash_size=4MB
ringo.build.flash_freq=40m
ringo.build.flash_mode=dio
ringo.build.boot=dio
ringo.build.partitions=default
ringo.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DST7735_DRIVER -DST7735_REDTAB -DTFT_WIDTH=128 -DTFT_HEIGHT=160 -DTFT_MISO=19 -DTFT_MOSI=23 -DTFT_SCLK=18 -DTFT_CS=4 -DTFT_DC=0 -DTFT_RST=2 -DSPI_FREQUENCY=27000000
ringo.build.extra_flags=-Os -g3

ringo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
ringo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ringo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ringo.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
ringo.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x3D1000

ringo.menu.FlashFreq.80=80MHz
ringo.menu.FlashFreq.80.build.flash_freq=80m

ringo.menu.UploadSpeed.921600=921600
ringo.menu.UploadSpeed.921600.upload.speed=921600

ringo.menu.DebugLevel.none=None
ringo.menu.DebugLevel.none.build.code_debug=0

ringo.bootloader.tool=ringofirm
ringo.bootloader.tool.firmware=ringo/firmware.bin

##############################################################

spencer.name=Spencer by CircuitMess

spencer.vid.0=0x10c4
spencer.pid.0=0xea60

spencer.upload.tool=esptool_py
spencer.upload.maximum_size=1310720
spencer.upload.maximum_data_size=327680
spencer.upload.wait_for_upload_port=false

spencer.serial.disableDTR=true
spencer.serial.disableRTS=true

spencer.build.mcu=esp32
spencer.build.core=esp32
spencer.build.variant=d32
spencer.build.board=LOLIN_D32

spencer.build.f_cpu=240000000L
spencer.build.flash_size=4MB
spencer.build.flash_freq=40m
spencer.build.flash_mode=dio
spencer.build.boot=dio
spencer.build.partitions=default
spencer.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_LEDMATRIX -DCIRCUITOS_SERIALFLASH -DCIRCUITOS_NET -DTFT_WIDTH=0 -DTFT_HEIGHT=0 -DST7735_DRIVER
spencer.build.extra_flags=-Os -g3

spencer.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
spencer.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
spencer.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
spencer.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
spencer.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x3D1000

spencer.menu.FlashFreq.80=80MHz
spencer.menu.FlashFreq.80.build.flash_freq=80m

spencer.menu.UploadSpeed.921600=921600
spencer.menu.UploadSpeed.921600.upload.speed=921600

spencer.menu.DebugLevel.none=None
spencer.menu.DebugLevel.none.build.code_debug=0

spencer.bootloader.tool=spencerfirm
spencer.bootloader.tool.firmware=spencer/firmware.bin

##############################################################

jayd.name=Jay-D by CircuitMess

jayd.vid.0=0x10c4
jayd.pid.0=0xea60

jayd.upload.tool=esptool_py
jayd.upload.maximum_size=1310720
jayd.upload.maximum_data_size=327680
jayd.upload.wait_for_upload_port=false

jayd.serial.disableDTR=true
jayd.serial.disableRTS=true

jayd.build.mcu=esp32
jayd.build.core=esp32
jayd.build.variant=jayd
jayd.build.board=CM_JAYD

jayd.build.f_cpu=240000000L
jayd.build.flash_size=4MB
jayd.build.flash_freq=40m
jayd.build.flash_mode=dio
jayd.build.boot=dio
jayd.build.partitions=default
jayd.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_LEDMATRIX -DCIRCUITOS_U8G2FONTS -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_LEDMATRIX -DCIRCUITOS_SERIALFLASH -DST7735_DRIVER -DTFT_RGB_ORDER=TFT_BGR -DTFT_WIDTH=128 -DTFT_HEIGHT=160 -DTFT_MISO=-1 -DTFT_MOSI=23 -DTFT_SCLK=18 -DTFT_CS=32 -DTFT_DC=33 -DTFT_RST=2 -DSPI_FREQUENCY=27000000 -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=0 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MEMMAP -DCONFIG_SPIRAM_USE_MEMMAP=1 -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1
jayd.build.extra_flags=-O2

jayd.menu.PartitionScheme.min_spiffs=No OTA
jayd.menu.PartitionScheme.min_spiffs.build.partitions=noota_4MB
jayd.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
jayd.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
jayd.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x383000

jayd.menu.FlashFreq.80=80MHz
jayd.menu.FlashFreq.80.build.flash_freq=80m

jayd.menu.UploadSpeed.921600=921600
jayd.menu.UploadSpeed.921600.upload.speed=921600

jayd.menu.DebugLevel.none=None
jayd.menu.DebugLevel.none.build.code_debug=0

jayd.bootloader.tool=jaydfirm
jayd.bootloader.tool.firmware=jayd/firmware.bin

##############################################################

wheelson.name=Wheelson by CircuitMess

wheelson.vid.0=0x1a86
wheelson.pid.0=0x7523

wheelson.upload.tool=esptool_py
wheelson.upload.maximum_size=1310720
wheelson.upload.maximum_data_size=327680
wheelson.upload.wait_for_upload_port=false

wheelson.serial.disableDTR=true
wheelson.serial.disableRTS=true

wheelson.build.mcu=esp32
wheelson.build.core=esp32
wheelson.build.variant=wheelson
wheelson.build.board=CM_WHEELSON

wheelson.build.f_cpu=240000000L
wheelson.build.flash_size=4MB
wheelson.build.flash_freq=40m
wheelson.build.flash_mode=dio
wheelson.build.boot=dio
wheelson.build.partitions=default
wheelson.build.defines=-DCONFIG_ARDUINO_LOOP_STACK_SIZE=14000 -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_U8G2FONTS -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DST7735_DRIVER -DTFT_RGB_ORDER=TFT_BGR -DTFT_WIDTH=128 -DTFT_HEIGHT=160 -DTFT_MISO=-1 -DTFT_MOSI=13 -DTFT_SCLK=2 -DTFT_CS=32 -DTFT_DC=12 -DTFT_RST=-1 -DSPI_FREQUENCY=27000000 -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=1 -DCONFIG_SPIRAM_USE_MALLOC=1 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MALLOC -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1
wheelson.build.extra_flags=-O2 -g

wheelson.menu.PartitionScheme.min_spiffs=No OTA
wheelson.menu.PartitionScheme.min_spiffs.build.partitions=noota_4MB
wheelson.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
wheelson.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
wheelson.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x383000

wheelson.menu.FlashFreq.80=80MHz
wheelson.menu.FlashFreq.80.build.flash_freq=80m

wheelson.menu.UploadSpeed.921600=921600
wheelson.menu.UploadSpeed.921600.upload.speed=921600

wheelson.menu.DebugLevel.none=None
wheelson.menu.DebugLevel.none.build.code_debug=0

wheelson.bootloader.tool=wheelfirm
wheelson.bootloader.tool.firmware=wheelson/firmware.bin

##############################################################

byteboi.name=ByteBoi by CircuitMess

byteboi.vid.0=0x1a86
byteboi.pid.0=0x7523

byteboi.upload.tool=esptool_py
byteboi.upload.maximum_size=1310720
byteboi.upload.maximum_data_size=327680
byteboi.upload.wait_for_upload_port=false

byteboi.serial.disableDTR=true
byteboi.serial.disableRTS=true

byteboi.build.mcu=esp32
byteboi.build.core=esp32
byteboi.build.variant=byteboi
byteboi.build.board=CM_BYTEBOI

byteboi.build.f_cpu=240000000L
byteboi.build.flash_size=4MB
byteboi.build.flash_freq=40m
byteboi.build.flash_mode=dio
byteboi.build.boot=dio
byteboi.build.partitions=default
byteboi.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_U8G2FONTS -DCIRCUITOS_LOVYANGFX -DLOVYAN_PANEL=Panel_ILI9341 -DLOVYAN_FREQ=60000000 -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=1 -DCONFIG_SPIRAM_MEMTEST=0 -DCONFIG_SPIRAM_USE_MALLOC=1 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MALLOC -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1 -DLOVYAN_SCK=26 -DLOVYAN_MOSI=32 -DLOVYAN_MISO=5 -DLOVYAN_DC=21 -DLOVYAN_CS=33 -DLOVYAN_RST=27 -DLOVYAN_WIDTH=240 -DLOVYAN_HEIGHT=320 -DCIRCUITOS_LOVYANGFX_ZOOM=2
byteboi.build.extra_flags=-Os -g

byteboi.menu.PartitionScheme.game=Game for launcher (1MB SPIFFS)
byteboi.menu.PartitionScheme.game.build.partitions=byteboi
byteboi.menu.PartitionScheme.game.upload.maximum_size=2097152
byteboi.menu.PartitionScheme.game.upload.binary_start=0x110000
byteboi.menu.PartitionScheme.game.upload.spiffs_start=0x11000

byteboi.menu.PartitionScheme.standalone=Standalone game (1MB SPIFFS)
byteboi.menu.PartitionScheme.standalone.build.partitions=byteboi
byteboi.menu.PartitionScheme.standalone.upload.maximum_size=3080192
byteboi.menu.PartitionScheme.standalone.upload.binary_start=0x110000
byteboi.menu.PartitionScheme.standalone.upload.spiffs_start=0x11000

byteboi.menu.PartitionScheme.standalone_big=Big standalone game (0.5MB SPIFFS)
byteboi.menu.PartitionScheme.standalone_big.build.partitions=byteboi_big
byteboi.menu.PartitionScheme.standalone_big.upload.maximum_size=3604480
byteboi.menu.PartitionScheme.standalone_big.upload.binary_start=0x90000
byteboi.menu.PartitionScheme.standalone_big.upload.spiffs_start=0x11000

byteboi.menu.PartitionScheme.launcher=Launcher
byteboi.menu.PartitionScheme.launcher.build.partitions=byteboi_launcher
byteboi.menu.PartitionScheme.launcher.upload.maximum_size=983040
byteboi.menu.PartitionScheme.launcher.upload.binary_start=0x110000
byteboi.menu.PartitionScheme.launcher.upload.spiffs_start=0x11000
byteboi.menu.PartitionScheme.launcher.build.pscheme_defines=-DBYTEBOI_LAUNCHER

byteboi.menu.FlashFreq.80=80MHz
byteboi.menu.FlashFreq.80.build.flash_freq=80m

byteboi.menu.UploadSpeed.921600=921600
byteboi.menu.UploadSpeed.921600.upload.speed=921600

byteboi.menu.DebugLevel.none=None
byteboi.menu.DebugLevel.none.build.code_debug=0

byteboi.bootloader.tool=bbfirm
byteboi.bootloader.tool.firmware=byteboi/firmware.bin

##############################################################

synthia.name=Synthia by CircuitMess

synthia.vid.0=0x1a86
synthia.pid.0=0x7523

synthia.upload.tool=esptool_py
synthia.upload.maximum_size=1310720
synthia.upload.maximum_data_size=327680
synthia.upload.wait_for_upload_port=false

synthia.serial.disableDTR=true
synthia.serial.disableRTS=true

synthia.build.mcu=esp32
synthia.build.core=esp32
synthia.build.variant=synthia
synthia.build.board=CM_SYNTHIA

synthia.build.f_cpu=240000000L
synthia.build.flash_size=4MB
synthia.build.flash_freq=40m
synthia.build.flash_mode=dio
synthia.build.boot=dio
synthia.build.partitions=default
synthia.build.defines=-DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DTFT_OFF -DCONFIG_SPIRAM_SUPPORT=1 -DBOARD_HAS_PSRAM=1 -DCONFIG_SPIRAM_MEMTEST=0 -DCONFIG_SPIRAM_USE_MALLOC=1 -DCONFIG_SPIRAM_USE=SPIRAM_USE_MALLOC -mfix-esp32-psram-cache-issue -DCONFIG_SPIRAM_CACHE_WORKAROUND=1 -DDEBUG
synthia.build.extra_flags=-O2 -g

synthia.menu.PartitionScheme.min_spiffs=No OTA
synthia.menu.PartitionScheme.min_spiffs.build.partitions=no_ota
synthia.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
synthia.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
synthia.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x211000

synthia.menu.FlashFreq.80=80MHz
synthia.menu.FlashFreq.80.build.flash_freq=80m

synthia.menu.UploadSpeed.921600=921600
synthia.menu.UploadSpeed.921600.upload.speed=921600

synthia.menu.DebugLevel.none=None
synthia.menu.DebugLevel.none.build.code_debug=0

synthia.bootloader.tool=synthfirm
synthia.bootloader.tool.firmware=synthia/firmware.bin

##############################################################

chatter.name=Chatter by CircuitMess

chatter.vid.0=0x1a86
chatter.pid.0=0x7523

chatter.upload.tool=esptool_py
chatter.upload.maximum_size=1310720
chatter.upload.maximum_data_size=327680
chatter.upload.wait_for_upload_port=false

chatter.serial.disableDTR=true
chatter.serial.disableRTS=true

chatter.build.mcu=esp32
chatter.build.core=esp32
chatter.build.variant=chatter
chatter.build.board=CM_CHATTER

chatter.build.f_cpu=240000000L
chatter.build.flash_size=4MB
chatter.build.flash_freq=40m
chatter.build.flash_mode=dio
chatter.build.boot=dio
chatter.build.partitions=default
chatter.build.defines=-DCONFIG_ARDUINO_LOOP_STACK_SIZE=14000 -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_PIEZO_PWM -DCIRCUITOS_PIEZO_PWM_CHANNEL=15 -DCIRCUITOS_LOVYANGFX -DLOVYAN_PANEL=Panel_ST7735S -DLOVYAN_FREQ=27000000 -DLOVYAN_WIDTH=128 -DLOVYAN_HEIGHT=160 -DLOVYAN_MISO=-1 -DLOVYAN_MOSI=26 -DLOVYAN_SCK=27 -DLOVYAN_CS=-1 -DLOVYAN_DC=33 -DLOVYAN_RST=15 -DRADIOLIB_GODMODE
chatter.build.extra_flags=-O2 -g

chatter.menu.PartitionScheme.min_spiffs=No OTA
chatter.menu.PartitionScheme.min_spiffs.build.partitions=no_ota
chatter.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
chatter.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
chatter.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x211000

chatter.menu.FlashFreq.80=80MHz
chatter.menu.FlashFreq.80.build.flash_freq=80m

chatter.menu.UploadSpeed.921600=921600
chatter.menu.UploadSpeed.921600.upload.speed=921600

chatter.menu.DebugLevel.none=None
chatter.menu.DebugLevel.none.build.code_debug=0

chatter.bootloader.tool=chatfirm
chatter.bootloader.tool.firmware=chatter/firmware.bin

##############################################################

circuitpet.name=CircuitPet by CircuitMess

circuitpet.vid.0=0x1a86
circuitpet.pid.0=0x7523

circuitpet.upload.tool=esptool_py
circuitpet.upload.maximum_size=1310720
circuitpet.upload.maximum_data_size=327680
circuitpet.upload.wait_for_upload_port=false

circuitpet.serial.disableDTR=true
circuitpet.serial.disableRTS=true

circuitpet.build.mcu=esp32
circuitpet.build.core=esp32
circuitpet.build.variant=circuitpet
circuitpet.build.board=CM_CIRCUITPET

circuitpet.build.f_cpu=240000000L
circuitpet.build.flash_size=4MB
circuitpet.build.flash_freq=40m
circuitpet.build.flash_mode=dio
circuitpet.build.boot=dio
circuitpet.build.partitions=default
circuitpet.build.defines=-DCONFIG_ARDUINO_LOOP_STACK_SIZE=14000 -DCIRCUITOS_FREERTOS -DCIRCUITOS_NVS -DCIRCUITOS_PIEZO_PWM -DCIRCUITOS_PIEZO_PWM_CHANNEL=15 -DCIRCUITOS_LOVYANGFX -DLOVYAN_PANEL=Panel_ST7735S -DLOVYAN_FREQ=27000000 -DLOVYAN_WIDTH=128 -DLOVYAN_HEIGHT=160 -DLOVYAN_MISO=-1 -DLOVYAN_MOSI=13 -DLOVYAN_SCK=14 -DLOVYAN_CS=-1 -DLOVYAN_DC=16 -DLOVYAN_RST=-1
circuitpet.build.extra_flags=-O2 -g

circuitpet.menu.PartitionScheme.min_spiffs=No OTA
circuitpet.menu.PartitionScheme.min_spiffs.build.partitions=no_ota
circuitpet.menu.PartitionScheme.min_spiffs.upload.maximum_size=3612672
circuitpet.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
circuitpet.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x211000

circuitpet.menu.FlashFreq.80=80MHz
circuitpet.menu.FlashFreq.80.build.flash_freq=80m

circuitpet.menu.UploadSpeed.921600=921600
circuitpet.menu.UploadSpeed.921600.upload.speed=921600

circuitpet.menu.DebugLevel.none=None
circuitpet.menu.DebugLevel.none.build.code_debug=0

circuitpet.bootloader.tool=chatfirm
circuitpet.bootloader.tool.firmware=chatter/firmware.bin

##############################################################
